/**
	HAL_SPI1_Transmit(&hspi2, &p_datum,1, 1000);
	HAL_SPI1_Receive(&hspi3,RxData, 1, 0xffff); 
	HAL_SPI1_TransmitReceive(&hspi1,&d_send,&d_read,1,0xFF);
	
作者:刘东辉
  */
#ifndef __STM32F1XX_SPI1_H__
#define	__STM32F1XX_SPI1_H__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
/* 类型定义 ------------------------------------------------------------------*/
/* 宏定义 --------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
extern SPI_HandleTypeDef hspi1;
/* 函数声明 ------------------------------------------------------------------*/
extern void MX_SPI1_Init(void);
#endif /* __STM32F1XX_SPI1_H__ */

