/**

作者:刘东辉
  */
#ifndef __STM32F1XX_ADC3_H__
#define	__STM32F1XX_ADC3_H__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
/* 宏定义 --------------------------------------------------------------------*/
#define ADC3_CHANNEL_NUMBER 4  //连续转换通道个数
/* 类型定义 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
extern ADC_HandleTypeDef hadc3;
extern uint32_t adc3_buffer[ADC3_CHANNEL_NUMBER];
/* 函数声明 ------------------------------------------------------------------*/
extern void MX_ADC3_Init(void);
extern void MX_ADC3_Read(void);
/*----------------------------------------------------------------------------*/
#endif /* __STM32F1XX_ADC3_H__ */

