/**

作者:刘东辉
  */
#ifndef __STM32F1XX_ADC2_H__
#define	__STM32F1XX_ADC2_H__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
/* 宏定义 --------------------------------------------------------------------*/
#define ADC2_CHANNEL_NUMBER 4  //连续转换通道个数
/* 类型定义 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
extern ADC_HandleTypeDef hadc2;
extern uint32_t adc2_buffer[ADC2_CHANNEL_NUMBER];
/* 函数声明 ------------------------------------------------------------------*/
extern void MX_ADC2_Init(void);
extern void MX_ADC2_Read(void);
/*----------------------------------------------------------------------------*/
#endif /* __STM32F1XX_ADC2_H__ */

