/*

作者:刘东辉
*/

#ifndef __STM32F1XX_DELAY_US__
#define __STM32F1XX_DELAY_US__
/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
/* 宏定义 --------------------------------------------------------------------*/
#define _delay_us(n) delay_us(n, (((SystemCoreClock/1000000)*2)/3))
#define _delay_ms(n) delay_ms(n, (((SystemCoreClock/1000000)*2)/3))
/* 类型定义 ------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
/* 函数声明 ------------------------------------------------------------------*/
extern void delay_us(uint32_t usec, uint8_t freq);
extern void delay_ms(uint32_t usec, uint8_t freq);
#endif
