/*
#include "stm32f1xx_ms5611.h" //MS5611气压传感器 读取函数
	ms5611_init(); //初始化MS5611
	ms5611_read_datum(); //读取MS5611

作者:刘东辉 
*/
#ifndef __STM32F1XX_MS5611_H__
#define __STM32F1XX_MS5611_H__

/* 包含头文件 ----------------------------------------------------------------*/
#include "stm32f1xx_hal.h"
/* 类型定义 ------------------------------------------------------------------*/
typedef struct {
	uint16_t correct[7]; //矫正
	float pressure; //气压
	float temperature; //温度
} _MS5611;
/* 宏定义 --------------------------------------------------------------------*/
/* 扩展变量 ------------------------------------------------------------------*/
extern _MS5611 g_ms5611;
/* 函数声明 ------------------------------------------------------------------*/
extern void ms5611_init(void);
extern void ms5611_read_datum(void);
#endif  //__MS5611_H__
